<template>
    <div id="two-center-two">
        <dv-border-box-9>
            <div style="width:100%;height:100%">
                <div id="two-center-two-title">膳食搭配</div>
                <dv-scroll-board :config="config" style="color:rgb(218,232,255);width:95%;height:77%;margin: auto;" />
            </div>
        </dv-border-box-9>
    </div>
</template>
<script>

export default {
    name: 'TwoCenterTwo',
    data: function () {
        return {
            config: {
                header: ['早餐', '加餐', '午餐', '加餐', '晚餐'],
                data: [
                    ['鸡蛋羹1个', '坚果', '番茄豆腐煲', '酸奶', '多面馒头'],
                    ['麻酱花卷', '弥猴桃', '青椒炒虾仁', '', '醋炒绿豆芽'],
                    ['小米枸杞粥', '', '尬炒紫甘兰', '', '1号羹'],
                    ['小西红柿', '', '红薯云豆米饭', '', ''],
                    ['煮鸡蛋1个', '橙子', '青豆玉米粒', '弥猴桃', '三鲜蒸饺'],
                    ['黑豆豆浆', '', '青笋炒鸡丁', '', '西红柿炒菜花'],
                    ['白灼木耳', '', '清炒油麦菜', '', '百合绿豆粥'],
                    ['小馒头', '', '燕麦山药米饭', '', ''],
                    ['鸡蛋羹1个', '猕猴桃', '大拌菜', '酸奶', '素炒胡萝卜丝'],
                    ['豆浆', '', '草菇炒虾仁', '猕猴桃', '牛劳红豆意米粥'],
                    ['全麦面包', '', '清炒芦笋', '', '紫米馒头'],
                    ['蓝莓酱', '', '糙米大米饭', '', ''],
                    ['牛奶', '酸奶', '烧鱼块', '坚果', '1号奠'],
                    ['鸡蛋羹1个', '弥猴桃', '白灼芥兰', '葡萄', '白菜豆腐丝'],
                    ['小米窝头', '', '番茄炒菜花', '', '全买馒头'],
                    ['煮黄豆', '', '紫薯米饭', '', ''],
                    ['银耳豆浆', '苹果', '西红柿烧牛肉', '酸奶', '胡罗卜炒藕片'],
                    ['鸡蛋羹1个', '', '青炒荷兰豆', '弥猴桃', '小米馒头'],
                    ['全麦玉米馒头', '', '紫圆白菜拌青椒', '', '1号羹'],
                    ['五香豆干', '', '红豆米饭', '', ''],
                    ['山药红豆粥', '坚果', '青蒸鲈鱼', '酸奶', '紫米馒头'],
                    ['三鲜蒸饺', '柠檬泡水', '耗油生菜', '水果沙拉', '山药木耳'],
                    ['鸡蛋羹1个', '', '青椒炒茄丁', '', '1号葵'],
                    ['小西红柿', '', '南瓜米饭', '', ''],
                    ['素包子', '橘子', '海带排骨烫', '牛奶', '上汤娃娃菜'],
                    ['煮鸡蛋', '', '西兰花炒蘑菇', '坚果', '胡萝卜土豆双丝'],
                    ['牛奶', '', '白灼芥兰', '', '香葱鸡蛋饼'],
                    ['五香豆干', '', '香菇蒸饭', '', ''],
                ],
                rowNum: 4,
                waitTime:4000,
                headerBGC:'#00868B',
                align: ['center','center','center','center','center'],
                carousel: 'page'
            }
        }
    }
}
</script>
<style>
#two-center-two {
    width: 100%;
    height: 40%;
}

#two-center-two-box {
    width: 100%;
    height: 100%;
}
#two-center-two-title {
    width: 100%;
    padding: 3% 0 1% 0;
    text-align: center;
    font-size: 2rem;
    color: rgb(112,185,230);
}
</style>